<?php
//TODO:

// Heading
$_['heading_title']          = 'СТ меню';

// Text
$_['text_list']              = 'Список меню';
$_['text_add']               = 'добавить меню';
$_['text_edit']              = 'Редактировать меню';
$_['text_success']           = 'сохранено';
$_['text_list_menu']         = 'Список пунктов меню';
$_['text_extension']         = 'Расширения';

// Table
$_['table_head_id']          = 'ID';
$_['table_head_name']        = 'Наименование';
$_['table_head_action']      = 'Действие';

$_['button_edit']            = 'Переименовать меню';
$_['button_view_menu_items'] = 'Просмотр меню';

// Entry
$_['entry_title']            = 'Наименование';
$_['entry_link']             = 'Ссылка';
$_['entry_parent']           = 'Родительский пункт';
$_['entry_root']             = 'Корневой элемент';

// Error
$_['error_warning']          = 'Внимание: Пожалуйста, внимательно проверьте форму на наличие ошибок!';
$_['error_permission']       = 'Внимание: У вас нет прав на изменение меню';
$_['error_title']            = 'Название меню должно содержать от 1 до 255 символов!';
$_['error_delete_menu']      = 'Не может быть удален! У этого элемента есть дочерние элементы';
$_['error_parent']           = 'Что-то не так с выбором родительского пункта меню';
$_['error_link']             = 'Длина ссылки должна составлять от 1 до 255 символов!';
